import React from "react";
import LayoutNoContainer from "../components/Layouts/LayoutNoContainer";
import wezaraDahelya from "../public/images/wezara-dahelya.webp";
import wezaraAdl from "../public/images/wezara-adl.png";

import Image, { StaticImageData } from "next/image";
import Head from "next/head";

import { ChevronDownIcon } from "@heroicons/react/24/outline";
import * as Accordion from "@radix-ui/react-accordion";
import Link from "next/link";

function formatToArray(string: string): { header: string; content: string }[] {
  return string
    .split("\n")
    .map((str) => {
      console.log(str);
      const [header, content] = str
        .trim()
        .split(/\:/)
        .map((x) => x.trim());

      if (!header || !content) return null;

      return {
        header,
        content,
      };
    })
    .filter((x) => x != null) as any;
}

function Rules() {
  const rulesData: {
    title: string;
    desc: string;
    logo: StaticImageData;
    rules: {
      header: string;
      content: string;
    }[];
    apply?: boolean;
    applyUrl?: string;
  }[] = [
    {
      title: "دستور الدولة",
      desc: `دستور الدولة تعتبر هي قوانين الرول بلاي والتى يجب
			على الجميع قرائتها والتأكد من حظفها وفهمها بالكامل
			وبعدها يمكنك ان تقوم بالتقدم للأختبار والتعرف على
			التفعيل في وولف لاند`,
      logo: wezaraDahelya,
      rules: [
        {
          header: "تعريف الرول بلاي",
          content:
            "تقمص وتمثيل الشخصية باللعب قولاً وفعلاً مع مراعاة مجريات أحداث اللعبة وما يدور حولك في المنطقة، ومقارنة اللعب داخل السيرفر بالحياة الواقعية، وعدم الخروج عن الواقعية أثناء تمثيل شخصيتك. ",
        },
        {
          header: "الدهس أو الصدم بالمركبة - VDM",
          content:
            "استخدام المركبة كسلاح لقتل الأشخاص.\nدم لمركبة كل دقيقة  او الصدم على سرعة فوق ال 100 \nالقتل عن طريق الصدم بالمركبة او صدم المركبات ممنوع ومخالف للنظام العام للسيرفر.",
        },
        {
          header: "الخوف على الحياة - NVL",
          content: `عدم الخوف بشكل واقعي على حياتك عندما تتعرض للتهديد بالأسلحة أو بأذى شديد من وسائل أخرى يعتبر الخوف على الحياة شي اساسي ومهم جدا 

					مثال : اذا كان هناك اداة تعرض حياتك للخطر`,
        },

        {
          header: "القتل العشوائي - RDM",
          content: `قتل الأشخاص دون سبب,  تهديد, بصورة عشوائية او بدون عداوة يعتبر القتل العشوائي ممنوع ومخالف للنظام العام للسيرفر.`,
        },
        {
          header: "قانون تقدير حياتك - LAR",
          content: `هي الحفاظ على حياتك وحياة الآخرين، وعدم التهور، وأن لا تستهين بقتل الأشخاص، وأن لا تقاوم المجرم أو الشرطة او اي شحص يحمل سلاح مهما كان خصوصاُ اذا كنت أعزل، وهذا لا يمنع استعمال حق الدفاع عن النفس عند الضرورة التي تمنعك من طلب مساعدة الشرطة، وبكل الأحوال يجب محاورة اللاعب بشكل جيد والتفاوض معه قبل الشروع بأي عمل يعرض حياة اللاعب الآخر للخطر.`,
        },
        {
          header: "الـقـانـون الـذهـبـي",
          content: `- هو احترام و تقدير جميع المواطنين في دولة دارث تاون و عدم رد الخطاء بـ الخطاء سؤا وجود إداري او مؤوسس .`,
        },

        {
          header: "قـانـون الـحـجـاز الـسـمـعـي",
          content: `- يمنع عليك سماع الأشخاص اذا كان بينك و بينه مسافه مثال ( جدار ، نافذه ) و الأخره .`,
        },
        {
          header: "قـانـون TALK",
          content: `- هو يمنع التحدث بـ اي شكل من الاشكال امام :
          - المنشآت الحكومية .
          - السرقات او السناريوهات .
          - ساحات الأعدام .
          - المحكمه .`,
        },
        {
          header: "قـانـون الـكـلـبـشـه",
          content: `- تروح عند ظهره و تضربه بـ يدك و تقول انت مكلبش او اذا تبي تفك الكلبشه نفس الأمر .`,
        },
        {
          header: "نظام التحذيرات",
          content: `في حال مخالفة اي قانون يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`,
        },
      ],
      apply: true,
      applyUrl: `/apply`,
    },
    {
      title: "مـصـطـلـحـات الـواقـعـيـه",
      desc: `- مصطلحات الواقعيه هي المصطلحات التي يجب عليك التحدث فيها اثناء الرحلات بدلاً من المصطلحات العامه لـ الاحساس بـ الواقعيه بـ شكل افضل و اكبر و لـ تحسين الواقعيه`,
      logo: wezaraDahelya,
      rules: formatToArray(`- الـبـنـد 1 : تقطيع النت - مصدع .

      - الـبـنـد 2 : طلع من القيم - سافر .
      
      - الـبـنـد 3 : الدسكورد - برنامج الدولة .
      
      - الـبـنـد 4 : مايك ، مايكك - حنجره ، حنجرتك .
      
      - الـبـنـد 5 : خارج الرول بلي - خارج الواقع الافتراضي .
      
      - الـبـنـد 6 : قلتش - سحر اسود .
      
      - الـبـنـد 7 : مات - اغمى عليه ، اصيب .
      
      - الـبـنـد 8 : بروح و بجي - بـ اخذ غفوه .
      
      - الـبـنـد 9 : رتبته - بطاقته .
      
      - الـبـنـد 10 : قيم - رحلة .
      
      - الـبـنـد 11 : ازرار اليده - العضله .
      
      - الـبـنـد 12 : بوت - مدني .
      
      - الـبـنـد 13 : يوجد مخرب - يوجد ارهابي .
      
      - الـبـنـد 14 : ايدي - رقم الجوال .
      
      - الـبـنـد 15 : مخالف لـ المصطلحات - ما افهم على لغتك .
      
      - الـبـنـد 16 : انتهاء القيم - اعصار .
      
      - الـبـنـد 17 : سيرفر - مدينة .`),
    },
    {
      title: "قوانين السرقات و السناريوهات",
      logo: wezaraDahelya,
      desc: "",
      rules:
        formatToArray(`- الـبـنـد 1 : في حالة التفاوض يجب على الطرفين الألتزام بـ الصمت و يسمح فقط للمتفاوضين التحدث .

      - الـبـنـد 2 : يجب على الطرفين الأحترام المتبادل و عدم قول اقوال نابيه مثل ( سبك ، هطف ، يا ضعيف ، و الى اخره ) .
      
      - الـبـنـد 3 : يجب على اعضاء العصابه احترام الرهينه و عدم إهانة لـ اي سبب كان .
      
      - الـبـنـد 4 : يمنع توقف السناريو و اذا حصلت مخالفه من بعض الاطراف يجب اكمال السناريو و بعد الرحله التوجه لـ المسؤولين .
      
      - الـبـنـد 5 : سوف تكون هناك مراقبه من هيئة الرقابه و يمنع منعاً باتاً التحدث معهم .
      
      - الـبـنـد 6 : يمنع منعاً باتاً التدخل الخارجي .
      
      - الـبـنـد 7 : يمنع مشاركة المواطن مع العصابات او غيره في السناريوهات .
      
      - الـبـنـد 8 : يسمح لـ المواطنين سرقة البقالة و محل الملابس فقط .
      
      - الـبـنـد 9 : في حال تم فشل التفاوض يمنع بداء الطلق الا بعد العد الى 15 ثانيه من قبل وزارة الداخلية .
      
      - الـبـنـد 10 : في حال انتصار العصابات يتم تسليم المبلغ من طرف هيئة الرقابه بعد الرحلة ، في حال خسارة العصابات لا يتم تسليم مبلغ .
      
      - الـبـنـد 11 : وزارة الداخلية لا تسلم اي مبلغ الا في حال تواجد رهينه فقط .
      
      - الـبـنـد 12 : يجب على وزارة الداخلية الخوف على حياة الرهائن .
      
      - الـبـنـد 13 : يجب ان يكون هناك وقت فاصل بين كل سرقة و سرقه و هي 3 دقائق .
      
      - الـبـنـد 14 : يمنع على العصابات او وزارة الداخلية تسبب فوضه في السرقات يجب ان يكون اشكالية السيارات و التنظيم بـ شكل ممتاز .
      
      - الـبـنـد 15 : يمنع على المتفاوضين رفع الأسلحه في حالة التفاوض .
      
      - الـبـنـد 16 : يمنع تكرار السرقات يجب التنويع .
      
      - الـبـنـد 17 : في حال تم اصابتك يمنع عليك منعاً باتاً الرجوع لـ السناريو .
      
      - الـبـنـد 18 : يمنع سرقة اي شي من ممتلكات الدولة بدون تفاوض .
      
      - الـبـنـد 19 : يمنع منعاً باتاً رفع الاسلحه في مناطق السناريو الا بعد نزول إعلان السطو على المكان و تتحول من منطقه امنه الى منطقه غير امنه .
      
      - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 19 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },
    {
      title: "عدد و اسعار السرقات و الخطف",
      logo: wezaraDahelya,
      desc: "",
      rules: formatToArray(`
      - الـبـنـد 1 : يجب على الجميع الألتزام في عدد الأعضاء في السرقات و المتطلب الأجباري .

      - الـبـنـد 2 :  - المتطلب الأجباري [ 40,000$ ] .البنك المركزي [ 4 - 8 ] .
      
      - الـبـنـد 3 : - المتطلب الأجباري [ 35,000$ ] . الدسكو [ 4 - 8 ] .
      
      - الـبـنـد 4 : - المتطلب الأجباري [ 25,000$ ] . كهرب المدينة [ 3 - 5 ] .
     
      - الـبـنـد 5 : - المتطلب الأجباري [ 25,000$ ] . محل الأسلحه [ 3 - 5 ] .
     
      - الـبـنـد 6 : - المتطلب الأجباري [ 20,000$ ] . محل الملابس [ 2 - 5 ] .
     
      - الـبـنـد 7 :- المتطلب الأجباري [ 10,000$ ] . البقالة [ 2 - 3 ] .
      
      - الـبـنـد 8 :- المتطلب الأجباري [ 2,000$ ] . خطف مواطن :
      
      - الـبـنـد 9 : - المتطلب الأجباري [ 10,000$ ] . خطف عضو فرد من وزارة الداخلية :
     
      - الـبـنـد 10 : - المتطلب الأجباري [ 30,000$ ] . خطف عضو ضابط من وزارة الداخلية :
     
      - الـبـنـد 11 : - المتطلب الاجباري [ 50,000$ ] . خطف رئيس او ماشابه من منسوبي وزارة الداخلية :
      
      - الـبـنـد 12 : - المتطلب الاجباري [ 80,000$ ] . خطف عضو من مسؤولين الدولة من وزارة الداخلية :
     
      - الـبـنـد 13 : - المتطلب الاجباري [ 100,000$ ] . خطف وزير او ماشابه :
     
      - الـبـنـد 14 : - المتطلب الاجباري [ 200,000$ ] . خطف رئيس الوزراء او نائبه :
     
      - الـبـنـد 15 : يجب على السارقين التنوع في السرقات و عدم تكرار السرقات لـ ضمن متعه اكثر .
      
      - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 15 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )
        `),
    },
    {
      title: "قوانين الاعدام",
      desc: "",
      logo: wezaraDahelya,
      rules:
        formatToArray(`- الـبـنـد 1 : الأعدام لـ وزارة الداخلية و العصابات يكون في المسرح .

      - الـبـنـد 2 : يسمح لـ وزارة الداخلية و العصابات مداهمة الأعدام بعد تنزيل اعلان المداهمه .
      
      - الـبـنـد 3 : يمنع منعاً باتاً الأعدام بدون اي سبب سوا للعسكريه و العصابات .
      
      - الـبـنـد 4 : يجب قبل الأعدام تنزيل اعلان و الأنتظار لـ مدة ( 5 دقائق ) ثم بداء عملية الأعدام ، يجب على الطرف الأخر تنزيل اعلان قبل المداهمه .
      
      - الـبـنـد 5 : يسمح التفاوض السلمي الغير مبالغ فيه في الأعدام و اذا تم فشل الاتفاوض يتم اعدام الرهينه فوراً و يبدا إطلاق النار بعد العد الى 15 ثانيه ، إفشال التفاوض يكون من خلال الطرف الأخر .
      
      - نـقـطـة مـهـمـه لـ الـمـعـدوم : في حال تم اعدامك يتم إعطائك رتبة معدوم لـ مدة 3 ايام ( 72 ساعة ) و يتم تصفير حسابك البنكي و رتبك ، و تبداء من جديد بـ شخصيه جديده و اسم جديد في الرول بلاي .
      
      - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 5 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },
    {
      title: "قوانين المركبات",
      desc: "",
      logo: wezaraDahelya,
      rules:
        formatToArray(`- الـبـنـد 1 : يمنع لـ اصحاب السيارات الرياضيه او الصغيره صعود الجبال .

        - الـبـنـد 2 : يمنع ركوب الدرجات او الشاحنات .
        
        - الـبـنـد 3 : يمنع القفز من اماكن عاليه سوا كان سيارات رياضيه او سيارات فرود .
        
        - الـبـنـد 4 : في حال انقلاب السياره يجب الأنتظار لـ مدة 15 ثانيه بعدها يسمح تعديل السياره .
        
        - الـبـنـد 5 : في حال تم انفجار 3 كفرات يجب الوقوف الأجباري .
        
        - الـبـنـد 6 : في حال تم اصتدامك صدمه احترافيه يجب الوقوف لـ مدة 5 ثواني .
        
        - الـبـنـد 7 : في حال تم اصتدامك صدمه قويه يجب الوقوف لـ مدة 3 ثواني .
        
        - الـبـنـد 8 : يمنع الوقوف في منتصف الطريق ، يسمح الوقوف فقط على الأرصفه التي لا يوجد عليها خط احمر و يسمح الوقوف في المواقف .
        
        - الـبـنـد 9 : يجب عليك الأحتفاظ على سيارتك و عدم تدميرها بـ العمد .
        
        - السرعه داخل المدينة : ( 40 ، 60 ) .

        - السرعه خارج المدينة : ( 80 ، 140 ) .
        
        - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 10 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },
    {
      title: "قوانين الخيانه والانقلاب",
      desc: "",
      logo: wezaraDahelya,
      rules: formatToArray(`- الـمـادة 7 : قـوانـيـن الـخـيـانـه و الأنـقـلاب .

        - تـعـريـف الـخـيـانـه : - هي التجسس و اخذ البيانات و المعلومات المهمه من الطرف الأخر لـ إعدام الشخص او استدراج شخص و غيرها .
        
        - تـعـريـف الأنـقـلاب : - هي تجمع عدد من الموظفين و الأنقلاب على الرئيس لـ اعدامه او ازاحته من منصبه و الأستيلا على المنصب .
        
        - الـبـنـد 1 : يمنع الخيانه و الأنقلاب في العسكريه بـ جميع انواعها منعاً باتاً .
        
        - الـبـنـد 2 : يسمح الخيانه بـ العصابات لـ اهتمامها بـ الأجرام و غيرها .
        
        - الـبـنـد 3 : يمنع الأنقلاب في العصابات بـ جميع انواعها منعاً باتاً .
        
        - الـبـنـد 4 : الخيانه في العسكريه او الأنقلاب تكون فقط بـ اتفاق على سناريو من قبل الشؤون الإداريه .
        
        - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 4 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },
    {
      title: "قـوانـيـن الـمـقـاومـه",
      desc: "",
      logo: wezaraDahelya,
      rules:
        formatToArray(`- الـبـنـد 1 : في حال كان الطرف الاخر اكثر منك عدد يمنع المقاومه و يجب تسليم نفسك فوراً .

      - الـبـنـد 2 : في حال كان الطرف الاخر متعادل بينكم ب العدد و قمت برفع السلاح فوراً ف يسمح لك المقاومه و يجب عليه تسليم نفسه .
      
      - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 2 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },
    {
      title: "قـوانـيـن الـذوق الـعـام",
      desc: "",
      logo: wezaraDahelya,
      rules:
        formatToArray(`- الـبـنـد 1 : يمنع لبس الملابس الغير واقعيه او المخله للأداب .

        - الـبـنـد 2 : يمنع منعاً باتاً لبس الملابس الخاصه بالعساكر و انت ليس بعسكري .
        
        - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 2 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
    },

    /*


      - الـبـنـد 3 : 
      
      - الـبـنـد 4 :
      
      - الـبـنـد 5 : 
      
      - الـبـنـد 6 : 
      
      - الـبـنـد 7 : 
      
      - الـبـنـد 8 : 
    */
    {
      title: "قـوانـيـن الـمـنـاطـق",
      desc: "",
      logo: wezaraDahelya,
      rules: [
        {
          header: "البند 1",
          content: `الـمـنـاطـق الأمـنـه :
        - يمنع فيها القتل .
        - يمنع فيها التهديد .
        - يمنع فيها الخطف .
        - يمنع منعاً باتاً اخراج السلاح ( للمواطنين ) .
        - يمنع فيها رفع السلاح الثقيل ( للعساكر ) .
       `,
        },
        {
          header: "البند 2",
          content: `الـمـنـاطـق الـمـحـظـوره :
          - يمنع فيها تشغيل الأغاني او التفحيط .
          - يمنع منعاً باتاً التسبب بـ الأزعاج .
          - يمنع منعاً باتاً قطع الأشارات .
          - يمنع منعاً باتاً عكس السير .
          - يمنع تكسير الإشارات .
          `,
        },
        {
          header: "البند 3",
          content: `الـمـنـاطـق الـغـيـر أمـنـه :
        - يسمح فيها الخطف .
        - يسمح فيها القتل ولكن بعد التهديد او الأنذار .`,
        },
        {
          header: "البند 4",
          content: `الـمـنـاطـق البنفسجية :
        - يسمح فيها القتل بدون تهديد .`,
        },
        {
          header: "البند 5",
          content: `المناطق الأمنه هي :
        - مقرات وزارة الداخلية .
        - نقطة التفتيش .
        - مدينة لوس سانتوس بـ اكملها .
        - مربع الحديقة الملكيه .`,
        },
        {
          header: "البند 6",
          content: `المناطق المحظوره هي :
        - مربع الحديقة الملكيه .
        - المناطق الحكومية .`,
        },
        {
          header: "البند 7",
          content: `المناطق الغير امنه هي :
        - مدينة سنادي شور .
        - ولاية بوليتو .
        - مناطق السرقات .`,
        },
        {
          header: "البند 8",
          content: `المناطق البنفسجية هي :
        - مقرات العصابات .
        - المنطقه المهجوره .`,
        },
        ...formatToArray(`
      - الـبـنـد 9 : يمنع الطلق من منطقة غير امنه الى منطقة امنه .
      
      - الـبـنـد 10 : يمنع منعاً باتاً مداهمة الأماكن الحكوميه .
      
      - مـلاحـضـه هـامة : في حال مخالفة اي بند من البنود 10 يمكن ان تتعرض لـ ( التحذيرات ، المخالف )`),
      ],
    },
  ];

  return (
    <LayoutNoContainer>
      <main className="!mb-16 space-y-16">
        <Head>
          <title>Wolfland - قوانين ولف لاند</title>
          <meta
            name="description"
            content="Wolfland - عالم الخيال والابداع فى الرول بلاى"
          />
          <link rel="icon" href="/favicon.ico" />
          <meta property="og:image" content="/favicon.png"></meta>
        </Head>
        <header className="bg-gradient-to-r from-primary to-root py-10">
          <div className="container mx-auto flex flex-col items-start gap-4">
            <h1 className="text-4xl font-bold md:text-5xl lg:text-6xl">
              القوانين
            </h1>
            <p className="max-w-2xl text-neutral-100">
              جميع القوانين اللازمة للانضمام لنا! تضمن القوانين العامة وقوانين
              الشرطة والعدل والاسعاف والرقابة والعصابات وتنويهات التقديم
            </p>
          </div>
        </header>

        <div className="container mx-auto space-y-8">
          <div className="flex flex-col items-center justify-center gap-4 text-center md:hidden">
            <div className="flex items-center gap-4 text-4xl font-bold md:text-5xl lg:text-5xl">
              <Image
                className=""
                src={wezaraDahelya}
                alt={"الوزارة الداخلية"}
                width={48}
                height={48}
              ></Image>
              <h1>القوانين العامة</h1>
            </div>
            <p className="max-w-2xl text-neutral-100">
              القوانين العامة تعتبر هي قوانين الرول بلاي والتى يجب على الجميع
              قرائتها والتأكد من حظفها وفهمها بالكامل وبعدها يمكنك ان تقوم
              بالتقدم للأختبار والتعرف على التفعيل في وولف لاند
            </p>
          </div>

          {rulesData.map((ruleSection, index) => {
            return (
              <div key={ruleSection.title} className="space-y-8">
                <div
                  className="w-full rounded-full border-2 border-root-200"
                  hidden={index === 0}
                ></div>

                <div className="flex flex-col items-start gap-6">
                  <div className="flex items-center gap-4 md:gap-6">
                    <Image
                      className="h-28 w-28 md:h-48 md:w-48"
                      src={ruleSection.logo}
                      alt={ruleSection.title}
                      width={192}
                      height={192}
                    ></Image>
                    <div className="flex flex-col items-start gap-6">
                      <h1 className="text-3xl font-bold md:text-4xl">
                        {ruleSection.title}
                      </h1>
                      <p className="hidden text-neutral-100 md:block">
                        {ruleSection.desc}
                      </p>
                      {ruleSection.apply && ruleSection.applyUrl && (
                        <Link
                          href={ruleSection.applyUrl}
                          className="btn-primary text-sm md:text-base"
                        >
                          التقديم الاليكترونى
                        </Link>
                      )}
                    </div>
                  </div>

                  <Accordion.Root
                    type="single"
                    className="w-full rounded-md bg-root-100"
                    collapsible={true}
                  >
                    {ruleSection.rules.map(({ content, header }) => {
                      return (
                        <Accordion.Item
                          key={header}
                          value={header}
                          className="overflow-hidden"
                        >
                          <Accordion.Header className="rounded-md bg-root-100">
                            <Accordion.Trigger className="AccordionTrigger flex w-full items-center justify-between rounded-md bg-root-100 py-2 px-4 hover:bg-root-200/25">
                              <span>{header}</span>
                              <ChevronDownIcon className="AccordionChevron h-5 w-5"></ChevronDownIcon>
                            </Accordion.Trigger>
                          </Accordion.Header>
                          <Accordion.Content className="AccordionContent overflow-hidden bg-root-200 px-4 text-neutral-100">
                            <p
                              className="py-2"
                              dangerouslySetInnerHTML={{
                                __html: content
                                  .replaceAll("\n", "<br/>")
                                  .trim(),
                              }}
                            ></p>
                          </Accordion.Content>
                        </Accordion.Item>
                      );
                    })}
                  </Accordion.Root>
                </div>
              </div>
            );
          })}
        </div>
      </main>
    </LayoutNoContainer>
  );
}

export default Rules;
